app/controllers/organizations_controller.rb

    def index
    	if session[:user_id].nil?
        	redirect_to users_index_path
    	else
    		@user = User.find(session[:user_id])
    		@orgs = Organization.all
    		@org = Organization.new
        	@members = Plan.select("plans.*, users.*").joins("LEFT JOIN users ON users.id = plans.user_id")
        	@plans = User.find(session[:user_id]).plans
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "organizations".* FROM "organizations"
SELECT plans.*, users.* FROM "plans" LEFT JOIN users ON users.id = plans.user_id WHERE (plans.organization_id = NULL)
SELECT "plans".* FROM "plans" WHERE "plans"."user_id" = ?  [["user_id", 1]]

    def show
    	@org = Organization.select("organizations.*, users.*").joins("LEFT JOIN users ON users.id = organizations.user_id").where("organizations.id = ?", params[:id]).first
  		@org[:id] = params[:id]
  		@members = Plan.select("plans.*, users.*").joins("LEFT JOIN users ON users.id = plans.user_id").where("plans.organization_id = ?", params[:id].to_i)
---
SELECT  organizations.*, users.* FROM "organizations" LEFT JOIN users ON users.id = organizations.user_id WHERE (organization.id = '7')  ORDER BY "organizations"."id" ASC LIMIT 1
SELECT plans.*, users.* FROM "plans" LEFT JOIN users ON users.id = plans.user_id WHERE (plans.organization_id = 7)

    def create
    	@org = Organization.new(name: params[:name], description: params[:description], user_id: params[:user_id])
  		@org[:user_id] = @org[:user_id].to_i
  		if @org.save
---
INSERT INTO "organizations" ("name", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

    def destroy
    	@org = Organization.find(params[:id].to_i)
    	if @org.destroy
---
SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT 1  [["id", nil]]
DELETE FROM "organizations" WHERE "organizations"."id" = ?  [["id", 1]]