app/controllers/users_controller.rb

  	def register
  		@user = User.create(user_params)
---
INSERT INTO "users" ("first_name", "last_name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)